In [2]:
import pandas

In [35]:

#Change in a row from prior record
original = pandas.read_csv(f"data-sources/row-change.csv", header=0)
display(original)
changed = pandas.read_csv(f"data-sources/row-change-diff.csv")
display(changed)
compared = original.compare(changed, keep_shape=True)
compared.columns = compared.columns.get_level_values(0)
new = compared.loc[:,~compared.columns.duplicated(keep='last')]
print("Record Changed")
display(new)

   id species  species_count
0   1  salmon              1

   id species  species_count
0   1  salmon              2

Record Changed

   id species  species_count
0 NaN     NaN              2

In [34]:
#delete record
original = pandas.read_csv(f"data-sources/row-delete.csv", header=0)
display(original)
changed = pandas.read_csv(f"data-sources/row-delete-diff.csv")
display(changed)
compared = changed.reindex_like(original).compare(original)
compared.columns = compared.columns.get_level_values(0)
new = compared.loc[:,~compared.columns.duplicated(keep='last')]
print('Record Deleted')
display(new)

   id species  species_count
0   1  salmon              1
1   2  salmon              5

   id species  species_count
0   1  salmon              1

Record Deleted

    id species  species_count
1  2.0  salmon            5.0

In [49]:
#add record
original = pandas.read_csv(f"data-sources/row-add.csv", header=0)
display(original)
changed = pandas.read_csv(f"data-sources/row-add-diff.csv")
display(changed)
new = changed[ ~changed.id.isin(original.id)].dropna()
display(new)

   id species  species_count
0   1  salmon              1

   id  species  species_count
0   1   salmon              1
1   2  pollock              2

   id  species  species_count
1   2  pollock              2